### <font color = 'red'> Class 14

#### Missing data

In [3]:
import numpy as np
import pandas as pd

In [4]:
vals1 = np.array([1,None,3,4])
vals1

array([1, None, 3, 4], dtype=object)

In [5]:
vals2 = np.array([1,np.nan,3,4])
vals2

array([ 1., nan,  3.,  4.])

In [6]:
#nan effects other values 
1 + np.nan

nan

In [7]:
vals2.sum()

nan

##### special aggregations to ignore the missing values

In [9]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [10]:
pd.Series([1,2,np.nan,3,None])

0    1.0
1    2.0
2    NaN
3    3.0
4    NaN
dtype: float64

##### Operating on null values

In [12]:
data = pd.Series([1,np.nan,'hello',None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [13]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [14]:
data.isnull().sum()

2

In [15]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [16]:
data.dropna()

0        1
2    hello
dtype: object

In [17]:
df = pd.DataFrame([
                    [1,np.nan,2],
                    [2,3,5],
                    [np.nan,4,6]    
])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [18]:
df.isnull().sum()

0    1
1    1
2    0
dtype: int64

In [19]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [20]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [21]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [22]:
df.dropna(axis='columns',how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [23]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [24]:
#keep only rows with min of 3 non null values
df.dropna(axis='rows',thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [25]:
df.dropna(axis='rows',thresh=2)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [26]:
data = pd.Series([1,np.nan,2,None,3],index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [27]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [28]:
#specify a forward fill to propagate the previous value forward
data.fillna(method='ffill')

C:\Users\user\AppData\Local\Temp\ipykernel_9660\366648970.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [29]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [30]:
df.fillna(method='ffill',axis=1)

C:\Users\user\AppData\Local\Temp\ipykernel_9660\2272395643.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [31]:
df1 = pd.DataFrame({
                    'employee':['Bob','Jake','Lisa','Sue'],
                    'group':['Accounting','Engineering','Engineering','HR']
})
df2 = pd.DataFrame({
                    'employee':['Bob','Jake','Lisa','Sue'],
                    'hire_date':[2004,2008,2011,2009]
})
print(df1);print('-'*20);print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
  employee  hire_date
0      Bob       2004
1     Jake       2008
2     Lisa       2011
3      Sue       2009

In [32]:
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2011
3      Sue           HR       2009

In [33]:
df4 = pd.DataFrame({
                     'group' : ['Accounting','Engineering','HR'],
                     'supervisor' : ['Carly','Guido','Steve']
})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [34]:
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2004      Carly
1     Jake  Engineering       2008      Guido
2     Lisa  Engineering       2011      Guido
3      Sue           HR       2009      Steve

In [66]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2011
3      Sue           HR       2009

In [78]:
df3 = pd.DataFrame({
                    'name' : ['Bob','Jake','Lisa','Sue'],
                    'salary' : [70000,80000,120000,90000]    
})
print(df1); print('-'*20);print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [82]:
df4 = pd.merge(df1,df3,left_on='employee',right_on='name')
df4

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [84]:
df4.drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [92]:
df6 = pd.DataFrame({'name' : ['Peter','Paul','Mary'],
                    'food' : ['fish','beans','bread']})
df7 = pd.DataFrame({'name' : ['Mary','Joseph'],
                    'drinks' : ['wine','beer']})

In [94]:
pd.merge(df6,df7)

   name   food drinks
0  Mary  bread   wine

##### Inner merges and shows only the available data

In [98]:
pd.merge(df6,df7,how='inner')

   name   food drinks
0  Mary  bread   wine

##### Outer will include nan as data for empty values

In [100]:
pd.merge(df6,df7,how='outer')

     name   food drinks
0  Joseph    NaN   beer
1    Mary  bread   wine
2    Paul  beans    NaN
3   Peter   fish    NaN

In [105]:
pd.merge(df6,df7,how='left')

    name   food drinks
0  Peter   fish    NaN
1   Paul  beans    NaN
2   Mary  bread   wine

In [107]:
pd.merge(df6,df7,how='right')

     name   food drinks
0    Mary  bread   wine
1  Joseph    NaN   beer